Revit 2027 API
PanelScheduleView.GenerateInstanceFromTemplate Method
 Assigns the data from the template to the instance and performs any tasks specific to the instance (3rd phase, borders, etc)
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void GenerateInstanceFromTemplate(
	ElementId templateId
)
Public Sub GenerateInstanceFromTemplate (
	templateId As ElementId
)
public:
void GenerateInstanceFromTemplate(
	ElementId^ templateId
)
member GenerateInstanceFromTemplate :
        templateId : ElementId -> unit
Parameters
templateId ElementId
 Element id of the template element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace